# ##############################################################################
#                                                                              #
#     Copyright (c) 2022 - 2023.                                               #
#     Haixing Hu, Qubit Co. Ltd.                                               #
#                                                                              #
#     All rights reserved.                                                     #
#                                                                              #
# ##############################################################################

CONFIG = {
    "prompt_template": {
        "instruction_template": "你的任务是根据给定的某个记录的字段，在给定的表格数据中"
                                "找到和该记录最匹配的1行数据，并输出匹配行的指定列的值。\n"
                                "给定的表格数据和记录数据均包含在3个单引号中，"
                                "以符合RFC-4180的CSV格式表示，其中第一行表示列名称。\n"        
                                "你的回复只能是最匹配的行的指定列的值。如果找不到最匹配的"
                                "行，或者不止一个最匹配的行，输出字符串 'NONE'。",
        "prompt_template": "表格数据：\n"
                           "'''\n"
                           "{known_records}"
                           "'''\n"
                           "记录数据：\n"
                           "'''\n"
                           "{query_record}"
                           "'''\n"
                           "请输出最匹配行的'{id_field}'列，"
                           "如果没有匹配或者不止一个最匹配的行'NONE'。",
        "example_input_prefix": "输入：\n",
        "example_input_suffix": "\n",
        "example_output_prefix": "输出：\n",
        "example_output_suffix": "\n\n",
        "examples": [{
            "input": "表格数据：\n"
                     "'''\n"
                     "编码,名称,规格\n"
                     "0084,负压采血管,EDTAK2 9ml\n"
                     "5237,大山楂颗粒,每袋装10g(低糖型)\n"
                     "4380,大山楂丸,每丸重9g\n"
                     "5903,九制大黄丸,每50粒重3g\n"
                     "'''\n"
                     "记录数据：\n"
                     "'''\n"
                     "名称\n"
                     "山楂丸\n"
                     "'''\n"
                     "请输出最匹配行的'名称'列，如果没有匹配或者不止一个最匹配的行，输出字符串'NONE'。",
            "output": "大山楂丸",
        }, {
            "input": "表格数据：\n"
                     "'''\n"
                     "编码,名称,规格\n"
                     "0084,负压采血管,EDTAK2 9ml\n"
                     "5237,大山楂颗粒,每袋装10g(低糖型)\n"
                     "4380,大山楂丸,每丸重9g\n"
                     "5903,九制大黄丸,每50粒重3g\n"
                     "'''\n"
                     "记录数据：\n"
                     "'''\n"
                     "名称\n"
                     "地黄丸\n"
                     "'''\n"
                     "请输出最匹配行的'编码'列，如果没有匹配或者不止一个最匹配的行'NONE'。",
            "output": "NONE",
        # }, {
        #     "input": "表格数据：\n"
        #              "'''\n"
        #              "编码,名称,规格,中文通用名\n"
        #              "0084,负压采血管,EDTAK2 9ml,203-采血管\n"
        #              "5237,大山楂颗粒,每袋装10g(低糖型),统筹外中成药\n"
        #              "4380,大山楂丸,每丸重9g,统筹外中成药\n"
        #              "5903,九制大黄丸,每50粒重3g,统筹外中成药\n"
        #              "'''\n"
        #              "记录数据：\n"
        #              "'''\n"
        #              "名称\n"
        #              "中成药\n"
        #              "'''\n"
        #              "请输出最匹配行的'名称'列，如果没有匹配或者不止一个最匹配的行'NONE'。",
        #     "output": "NONE",
        # }, {
        #     "input": "表格数据：\n"
        #              "'''\n"
        #              "编码,名称,规格,中文通用名\n"
        #              "0074,负压采血管,促凝管+分离胶 1ml,203-采血管\n"
        #              "0084,负压采血管,EDTAK2 9ml,203-采血管\n"
        #              "5237,大山楂颗粒,每袋装10g(低糖型),统筹外中成药\n"
        #              "4380,大山楂丸,每丸重9g,统筹外中成药\n"
        #              "5903,九制大黄丸,每50粒重3g,统筹外中成药\n"
        #              "'''\n"
        #              "记录数据：\n"
        #              "'''\n"
        #              "名称,规格\n"
        #              "采血管,1ml\n"
        #              "'''\n"
        #              "请输出最匹配行的'编码'列，如果没有匹配或者不止一个最匹配的行'NONE'。",
        #     "output": "0074",
        }],
    },
    "record_limit": 10,
    "record_score_threshold": 0.85,
}
